start_message = "Привет!\nЯ - День Рожденик, ваш личный "\
                "помощник по дням рождения.\n"\
                "Я могу помочь вам отслеживать дни "\
                "рождения ваших друзей и близких, "\
                "а также напоминать вам о них.\n\n"\
                "Если нужна будет помощь напиши /help"

help_message = "/start - Начало работы\n"\
               "/menu - Регистрация напоминалки о ДР\n"\
               "/edit - Внести изменение о напоминалке\n"\
               "/help - Помощь\n"\
               "/feedback - Обратная связь\n"

reg_message = "Выбери свой вариант из меню"

reg_birth_yes = "Напиши ФИО или прозвище\nЧей день рождения мы записываем"

reg_birth_date = "Хорошо, теперь напиши число и"\
                 "месяц Дня Рождения ➡️ {name}\n"\
                 r"Пример: 15.11, 01/10, 10-12, 01\10"

reg_birth_edit = "Напиши ФИО или прозвище\n"\
                 "Чей день рождения отредактировать?"

reg_birth_date_error = "Упс, такой формат даты я не понимаю...\n"\
                       "Попробуй любой вариант из примера выше."

birth_msg_error = "Упс.....🙊\n"\
                  "Что то пошло не так.\nК такому прозвищу/имени, "\
                  "Я не смогу придумать текст, простите 🙀"

reg_date_remember = "Когда ты хочешь, чтобы я напомнил тебе ?"

answer_about_add = "Создал напоминание!\n"\
                   "\nФИО/прозвище: {name}"\
                   "\nДата Дня Рождения: {date}"\
                   "\nДата напоминания о Дне Рождении: {remember_date}"

what_edit_questaion = "Что будем редактировать?\n\n"

what_edit_questaion_error = "Прости.....\n"\
                            "Не смог найти напоминание с таким именем: {name}"\
                            "\nПроверь список напоминаний или "\
                            "попробуй заного ввести имя"

list_remembers = "ФИО/прозвище: {row0}\n"\
                 "Дата дня рождения: {row1}\n"\
                 "Дата напоминания о Дне Рождении: {row2}\n\n"

edit_name = "Напиши новое ФИО/прозвище"

edit_remember_date = "Напиши новую дату напоминания о Дне Рождении"